<?php
  //finalfantasy xi common library
  
  $facename = array('----------------','エアハルト','ラファール','アレリオ','ジロー','ベイド','アザグバ','バートラム','エンケイ','ミア','モルガナ','エルウィン','キラ','アデラ','シェンメイ','エピオ','アウリス','ロテール','レンゲル','ルピエ','ロモン','シヴリオン','ボリアン','アジュノー','エテルミオン','エリエル','アルミード','エリーヴ','マリヨン','オペル','メノエ','アペシア','ヴェイラ','パンチャミンチャ','トンソルモーソル','アロバオロバ','クリドグリード','パイタマイタ','ジャマカソマカ','ヨランオーラン','プルダパゴッパ','メーリリ','パルル','ノッピピ','モココ','カタルル','アジョジョ','ポレレ','コットト','オピ','ペル','シャミ','スー','ユーン','キャル','ミオ','ソイ','ベアクロー','クレイジーアーム','ボーンイーター','スネークアイ','ドランガ','ジードフ','グランドウ','ガルムード');
  $racelist= array('Hume♂','Hume♀','Elvaan♂','Elvaan♀','Tarutaru♂','Tarutaru♀','Mithra♀','Galka♂');

?>
